MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
<?xml version="1.0" encoding="UTF-8" standalone="no" ?><device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd"><name>STM32L15xxxA</name><version>1.0</version><description>STM32L15xxxA</description><!--Bus Interface Properties--><!--Cortex-M3 is byte addressable--><addressUnitBits>8</addressUnitBits><!--the maximum data bit width accessible within a single transfer--><width>32</width><!--Register Default Properties--><size>0x20</size><resetValue>0x0</resetValue><resetMask>0xFFFFFFFF</resetMask><peripherals><peripheral><name>C_ADC</name><description>Common ADC registers</description><groupName>ADC</groupName><baseAddress>0x40012700</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>CSR</name><displayName>CSR</displayName><description>ADC Common status register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>ADONS1</name><description>ADON Status of ADC</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>OVR1</name><description>Overrun flag of ADC 1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>STRT1</name><description>Regular channel Start flag of ADC               1</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>JSTRT1</name><description>Injected channel Start flag of ADC               1</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOC1</name><description>Injected channel end of conversion of               ADC 1</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>EOC1</name><description>End of conversion of ADC 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>AWD1</name><description>Analog watchdog flag of ADC               1</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCR</name><displayName>CCR</displayName><description>ADC common control register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TSVREFE</name><description>Temperature sensor and VREFINT               enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>ADCPRE</name><description>ADC prescaler</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field></fields></register></registers></peripheral><peripheral><name>COMP</name><description>Comparators</description><groupName>COMP</groupName><baseAddress>0x40007C00</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>COMP_CA</name><description>Comparator wakeup through EXTI line (21 and
