MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
        22) interrupt/Channel acquisition interrupt</description><value>22</value></interrupt><interrupt><name>COMP_ACQ</name><description>Comparator Channel Acquisition</description><value>53</value></interrupt><registers><register><name>CSR</name><displayName>CSR</displayName><description>comparator control and status           register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>TSUSP</name><description>Suspend Timer Mode</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAIF</name><description>Channel acquisition interrupt               flag</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CAIE</name><description>Channel Acquisition Interrupt Enable /               Clear</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RCH13</name><description>Select GPIO port PC3 as re-routed ADC               input channel CH13.</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FCH8</name><description>Select GPIO port PB0 as fast ADC input               channel CH8.</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FCH3</name><description>Select GPIO port PA3 as fast ADC input               channel CH3.</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTSEL</name><description>Comparator 2 output               selection</description><bitOffset>21</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>INSEL</name><description>Inverted input selection</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>WNDWE</name><description>Window mode enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VREFOUTEN</name><description>VREFINT output enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CMP2OUT</name><description>Comparator 2 output</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SPEED</name><description>Comparator 2 speed mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CMP1OUT</name><description>Comparator 1 output</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SW1</name><description>SW1 analog switch enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CMP1EN</name><description>Comparator 1 enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PD400K</name><description>400 kO pull-down resistor</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PD10K</name><description>10 kO pull-down resistor</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PU400K</name><description>400 kO pull-up resistor</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PU10K</name><description>10 kO pull-up resistor</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>CRC</name><description>CRC calculation unit</description><groupName>CRC</groupName><baseAddress>0x40023000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>DR</name><displayName>DR</displayName><description>Data register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0xFFFFFFFF</resetValue><fields><field><name>Data_register</name><description>Data Register</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>IDR</name><displayName>IDR</displayName><description>Independent data register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>Independent_data_register</name><description>Independent data register</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field></fields></register><register><name>CR</name><displayName>CR</displayName><description>Control register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>RESET</name><description>RESET</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>DAC</name><description>Digital-to-analog converter</description><groupName>DAC</groupName><baseAddress>0x40007400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>DAC</name><description>DAC interrupt</description><value>21</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DMAUDRIE2</name><description>DAC channel2 DMA underrun interrupt               enable</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAEN2</name><description>DAC channel2 DMA enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>MAMP2</name><description>DAC channel2 mask/amplitude               selector</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>WAVE2</name><description>DAC channel2 noise/triangle wave               generation enable</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field><field><name>TSEL2</name><description>DAC channel2 trigger               selection</description><bitOffset>19</bitOffset><bitWidth>3</bitWidth></field><field><name>TEN2</name><description>DAC channel2 trigger               enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>BOFF2</name><description>DAC channel2 output buffer               disable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EN2</name><description>DAC channel2 enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAUDRIE1</name><description>DAC channel1 DMA Underrun Interrupt               enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAEN1</name><description>DAC channel1 DMA enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>MAMP1</name><description>DAC channel1 mask/amplitude               selector</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>WAVE1</name><description>DAC channel1 noise/triangle wave               generation enable</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>TSEL1</name><description>DAC channel1 trigger               selection</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>TEN1</name><description>DAC channel1 trigger               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BOFF1</name><description>DAC channel1 output buffer               disable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN1</name><description>DAC channel1 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SWTRIGR</name><displayName>SWTRIGR</displayName><description>software trigger register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>SWTRIG2</name><description>DAC channel2 software               trigger</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SWTRIG1</name><description>DAC channel1 software               trigger</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DHR12R1</name><displayName>DHR12R1</displayName><description>channel1 12-bit right-aligned data holding           register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC1DHR</name><description>DAC channel1 12-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR12L1</name><displayName>DHR12L1</displayName><description>channel1 12-bit left aligned data holding           register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC1DHR</name><description>DAC channel1 12-bit left-aligned               data</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR8R1</name><displayName>DHR8R1</displayName><description>channel1 8-bit right aligned data holding           register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC1DHR</name><description>DAC channel1 8-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>DHR12R2</name><displayName>DHR12R2</displayName><description>channel2 12-bit right aligned data holding           register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR12L2</name><displayName>DHR12L2</displayName><description>channel2 12-bit left aligned data holding           register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit left-aligned               data</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR8R2</name><displayName>DHR8R2</displayName><description>channel2 8-bit right-aligned data holding           register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 8-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>DHR12RD</name><displayName>DHR12RD</displayName><description>Dual DAC 12-bit right-aligned data holding           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit right-aligned               data</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field><field><name>DACC1DHR</name><description>DAC channel1 12-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR12LD</name><displayName>DHR12LD</displayName><description>DUAL DAC 12-bit left aligned data holding           register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit left-aligned               data</description><bitOffset>20</bitOffset><bitWidth>12</bitWidth></field><field><name>DACC1DHR</name><description>DAC channel1 12-bit left-aligned               data</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR8RD</name><displayName>DHR8RD</displayName><description>DUAL DAC 8-bit right aligned data holding           register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 8-bit right-aligned               data</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DACC1DHR</name><description>DAC channel1 8-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>DOR1</name><displayName>DOR1</displayName><description>channel1 data output register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DACC1DOR</name><description>DAC channel1 data output</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DOR2</name><displayName>DOR2</displayName><description>channel2 data output register</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DOR</name><description>DAC channel2 data output</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>status register</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DMAUDR2</name><description>DAC channel2 DMA underrun               flag</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAUDR1</name><description>DAC channel1 DMA underrun               flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>DMA1</name><description>Direct memory access controller</description><groupName>DMA</groupName><baseAddress>0x40026000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>DMA1_Channel1</name><description>DMA1 Channel1 global interrupt</description><value>11</value></interrupt><interrupt><name>DMA1_Channel2</name><description>DMA1 Channel2 global interrupt</description><value>12</value></interrupt><interrupt><name>DMA1_Channel3</name><description>DMA1 Channel3 global interrupt</description><value>13</value></interrupt><interrupt><name>DMA1_Channel4</name><description>DMA1 Channel4 global interrupt</description><value>14</value></interrupt><interrupt><name>DMA1_Channel5</name><description>DMA1 Channel5 global interrupt</description><value>15</value></interrupt><interrupt><name>DMA1_Channel6</name><description>DMA1 Channel6 global interrupt</description><value>16</value></interrupt><interrupt><name>DMA1_Channel7</name><description>DMA1 Channel7 global interrupt</description><value>17</value></interrupt><registers><register><name>ISR</name><displayName>ISR</displayName><description>interrupt status register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>TEIF7</name><description>Channel x transfer error flag (x = 1               ..7)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF7</name><description>Channel x half transfer flag (x = 1               ..7)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF7</name><description>Channel x transfer complete flag (x = 1               ..7)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF7</name><description>Channel x global interrupt flag (x = 1               ..7)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF6</name><description>Channel x transfer error flag (x = 1               ..7)</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF6</name><description>Channel x half transfer flag (x = 1               ..7)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF6</name><description>Channel x transfer complete flag (x = 1               ..7)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF6</name><description>Channel x global interrupt flag (x = 1               ..7)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF5</name><description>Channel x transfer error flag (x = 1               ..7)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF5</name><description>Channel x half transfer flag (x = 1               ..7)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF5</name><description>Channel x transfer complete flag (x = 1               ..7)</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF5</name><description>Channel x global interrupt flag (x = 1               ..7)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF4</name><description>Channel x transfer error flag (x = 1               ..7)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF4</name><description>Channel x half transfer flag (x = 1               ..7)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF4</name><description>Channel x transfer complete flag (x = 1               ..7)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF4</name><description>Channel x global interrupt flag (x = 1               ..7)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF3</name><description>Channel x transfer error flag (x = 1               ..7)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF3</name><description>Channel x half transfer flag (x = 1               ..7)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF3</name><description>Channel x transfer complete flag (x = 1               ..7)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF3</name><description>Channel x global interrupt flag (x = 1               ..7)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF2</name><description>Channel x transfer error flag (x = 1               ..7)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF2</name><description>Channel x half transfer flag (x = 1               ..7)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF2</name><description>Channel x transfer complete flag (x = 1               ..7)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF2</name><description>Channel x global interrupt flag (x = 1               ..7)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF1</name><description>Channel x transfer error flag (x = 1               ..7)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF1</name><description>Channel x half transfer flag (x = 1               ..7)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF1</name><description>Channel x transfer complete flag (x = 1               ..7)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF1</name><description>Channel x global interrupt flag (x = 1               ..7)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IFCR</name><displayName>IFCR</displayName><description>interrupt flag clear register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>CTEIF7</name><description>Channel x transfer error clear (x = 1               ..7)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF7</name><description>Channel x half transfer clear (x = 1               ..7)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF7</name><description>Channel x transfer complete clear (x = 1               ..7)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF7</name><description>Channel x global interrupt clear (x = 1               ..7)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF6</name><description>Channel x transfer error clear (x = 1               ..7)</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF6</name><description>Channel x half transfer clear (x = 1               ..7)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF6</name><description>Channel x transfer complete clear (x = 1               ..7)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF6</name><description>Channel x global interrupt clear (x = 1               ..7)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF5</name><description>Channel x transfer error clear (x = 1               ..7)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF5</name><description>Channel x half transfer clear (x = 1               ..7)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF5</name><description>Channel x transfer complete clear (x = 1               ..7)</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF5</name><description>Channel x global interrupt clear (x = 1               ..7)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF4</name><description>Channel x transfer error clear (x = 1               ..7)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF4</name><description>Channel x half transfer clear (x = 1               ..7)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF4</name><description>Channel x transfer complete clear (x = 1               ..7)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF4</name><description>Channel x global interrupt clear (x = 1               ..7)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF3</name><description>Channel x transfer error clear (x = 1               ..7)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF3</name><description>Channel x half transfer clear (x = 1               ..7)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF3</name><description>Channel x transfer complete clear (x = 1               ..7)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF3</name><description>Channel x global interrupt clear (x = 1               ..7)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF2</name><description>Channel x transfer error clear 