MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
(x = 1               ..7)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF2</name><description>Channel x half transfer clear (x = 1               ..7)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF2</name><description>Channel x transfer complete clear (x = 1               ..7)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF2</name><description>Channel x global interrupt clear (x = 1               ..7)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF1</name><description>Channel x transfer error clear (x = 1               ..7)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF1</name><description>Channel x half transfer clear (x = 1               ..7)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF1</name><description>Channel x transfer complete clear (x = 1               ..7)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF1</name><description>Channel x global interrupt clear (x = 1               ..7)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCR1</name><displayName>CCR1</displayName><description>channel x configuration           register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Channel priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR1</name><displayName>CNDTR1</displayName><description>channel x number of data           register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR1</name><displayName>CPAR1</displayName><description>channel x peripheral address           register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR1</name><displayName>CMAR1</displayName><description>channel x memory address           register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CCR2</name><displayName>CCR2</displayName><description>channel x configuration           register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Channel priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR2</name><displayName>CNDTR2</displayName><description>channel x number of data           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR2</name><displayName>CPAR2</displayName><description>channel x peripheral address           register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR2</name><displayName>CMAR2</displayName><description>channel x memory address           register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CCR3</name><displayName>CCR3</displayName><description>channel x configuration           register</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Channel priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR3</name><displayName>CNDTR3</displayName><description>channel x number of data           register</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR3</name><displayName>CPAR3</displayName><description>channel x peripheral address           register</description><addressOffset>0x38</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR3</name><displayName>CMAR3</displayName><description>channel x memory address           register</description><addressOffset>0x3C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CCR4</name><displayName>CCR4</displayName><description>channel x configuration           register</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Channel priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR4</name><displayName>CNDTR4</displayName><description>channel x number of data           register</description><addressOffset>0x48</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR4</name><displayName>CPAR4</displayName><description>channel x peripheral address           register</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR4</name><displayName>CMAR4</displayName><description>channel x memory address           register</description><addressOffset>0x50</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CCR5</name><displayName>CCR5</displayName><description>channel x configuration           register</description><addressOffset>0x58</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Channel priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR5</name><displayName>CNDTR5</displayName><description>channel x number of data           register</description><addressOffset>0x5C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR5</name><displayName>CPAR5</displayName><description>channel x peripheral address           register</description><addressOffset>0x60</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR5</name><displayName>CMAR5</displayName><description>channel x memory address           register</description><addressOffset>0x64</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CCR6</name><displayName>CCR6</displayName><description>channel x configuration           register</description><addressOffset>0x6C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Channel priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR6</name><displayName>CNDTR6</displayName><description>channel x number of data           register</description><addressOffset>0x70</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR6</name><displayName>CPAR6</displayName><description>channel x peripheral address           register</description><addressOffset>0x74</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR6</name><displayName>CMAR6</displayName><description>channel x memory address           register</description><addressOffset>0x78</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CCR7</name><displayName>CCR7</displayName><description>channel x configuration           register</description><addressOffset>0x80</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>PL</name><description>Channel priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half transfer interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNDTR7</name><displayName>CNDTR7</displayName><description>channel x number of data           register</description><addressOffset>0x84</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CPAR7</name><displayName>CPAR7</displayName><description>channel x peripheral address           register</description><addressOffset>0x88</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>CMAR7</name><displayName>CMAR7</displayName><description>channel x memory address           register</description><addressOffset>0x8C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register></registers></peripheral><peripheral><name>EXTI</name><description>External interrupt/event       controller</description><groupName>EXTI</groupName><baseAddress>0x40010400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>DMA2_CH1</name><description>DMA2 Channel 1 interrupt</description><value>47</value></interrupt><interrupt><name>DMA2_CH2</name><description>DMA2 Channel 2 interrupt</description><value>48</value></interrupt><interrupt><name>DMA2_CH3</name><description>DMA2 Channel 3 interrupt</description><value>49</value></interrupt><interrupt><name>DMA2_CH4</name><description>DMA2 Channel 4 interrupt</description><value>50</value></interrupt><interrupt><name>DMA2_CH5</name><description>DMA2 Channel 5 interrupt</description><value>51</value></interrupt><registers><register><name>IMR</name><displayName>IMR</displayName><description>IMR</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MR</name><description>Interrupt mask on line x</description><bitOffset>0</bitOffset><bitWidth>23</bitWidth></field></fields></register><register><name>EMR</name><displayName>EMR</displayName><description>EMR</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MR</name><description>Event mask on line x</description><bitOffset>0</bitOffset><bitWidth>23</bitWidth></field></fields></register