MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
        interrupts</description><value>2</value></interrupt><interrupt><name>EXTI0</name><description>EXTI Line0 interrupt</description><value>6</value></interrupt><interrupt><name>EXTI1</name><description>EXTI Line1 interrupt</description><value>7</value></interrupt><interrupt><name>EXTI2</name><description>EXTI Line2 interrupt</description><value>8</value></interrupt><interrupt><name>EXTI3</name><description>EXTI Line3 interrupt</description><value>9</value></interrupt><interrupt><name>EXTI4</name><description>EXTI Line4 interrupt</description><value>10</value></interrupt><interrupt><name>EXTI9_5</name><description>EXTI Line[9:5] interrupts</description><value>23</value></interrupt><interrupt><name>EXTI15_10</name><description>EXTI Line[15:10] interrupts</description><value>40</value></interrupt><registers><register><name>ACR</name><displayName>ACR</displayName><description>Access control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>LATENCY</name><description>Latency</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PRFTEN</name><description>Prefetch enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ACC64</name><description>64-bit access</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SLEEP_PD</name><description>Flash mode during Sleep</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>RUN_PD</name><description>Flash mode during Run</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>PECR</name><displayName>PECR</displayName><description>Program/erase control register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000007</resetValue><fields><field><name>PELOCK</name><description>FLASH_PECR and data EEPROM               lock</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PRGLOCK</name><description>Program memory lock</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>OPTLOCK</name><description>Option bytes block lock</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>PROG</name><description>Program memory selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DATA</name><description>Data EEPROM selection</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FTDW</name><description>Fixed time data write for Byte, Half               Word and Word programming</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ERASE</name><description>Page or Double Word erase               mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FPRG</name><description>Half Page/Double Word programming               mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>PARALLELBANK</name><description>Parallel bank mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>EOPIE</name><description>End of programming interrupt               enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRIE</name><description>Error interrupt enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>OBL_LAUNCH</name><description>Launch the option byte               loading</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>PDKEYR</name><displayName>PDKEYR</displayName><description>Power down key register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>PDKEYR</name><description>RUN_PD in FLASH_ACR key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>PEKEYR</name><displayName>PEKEYR</displayName><description>Program/erase key register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>PEKEYR</name><description>FLASH_PEC and data EEPROM               key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>PRGKEYR</name><displayName>PRGKEYR</displayName><description>Program memory key register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>PRGKEYR</name><description>Program memory key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>OPTKEYR</name><displayName>OPTKEYR</displayName><description>Option byte key register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>OPTKEYR</name><description>Option byte key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>Status register</description><addressOffset>0x18</addressOffset><size>0x20</size><resetValue>0x00000004</resetValue><fields><field><name>BSY</name><description>Write/erase operations in               progress</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EOP</name><description>End of operation</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ENDHV</name><description>End of high voltage</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>READY</name><description>Flash memory module ready after low               power mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>WRPERR</name><description>Write protected error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PGAERR</name><description>Programming alignment               error</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SIZERR</name><description>Size error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OPTVERR</name><description>Option validity error</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OPTVERRUSR</name><description>Option UserValidity Error</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OBR</name><displayName>OBR</displayName><description>Option byte register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00F80000</resetValue><fields><field><name>RDPRT</name><description>Read protection</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>BOR_LEV</name><description>BOR_LEV</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>IWDG_SW</name><description>IWDG_SW</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>nRTS_STOP</name><description>nRTS_STOP</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>nRST_STDBY</name><description>nRST_STDBY</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>BFB2</name><description>Boot From Bank 2</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>WRPR1</name><displayName>WRPR1</displayName><description>Write protection register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>WRP1</name><description>Write protection</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>WRPR2</name><displayName>WRPR2</displayName><description>Write protection register</description><addressOffset>0x80</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>WRP2</name><description>WRP2</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>WRPR3</name><displayName>WRPR3</displayName><description>Write protection register</description><addressOffset>0x84</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>WRP3</name><description>WRP3</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register></registers></peripheral><peripheral><name>GPIOA</name><description>General-purpose I/Os</description><groupName>GPIO</groupName><baseAddress>0x40020000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>FLASH</name><description>Flash global interrupt</description><value>4</value></interrupt><registers><register><name>MODER</name><displayName>MODER</displayName><description>GPIO port mode register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0xA8000000</resetValue><fields><field><name>MODER15</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>30</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER14</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>28</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER13</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>26</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER12</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER11</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER10</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER9</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER8</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER7</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER6</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER5</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER4</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER3</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER2</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER1</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>MODER0</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>OTYPER</name><displayName>OTYPER</displayName><description>GPIO port output type register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OT15</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>OT14</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>OT13</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>OT12</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>OT11</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>OT10</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OT9</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>OT8</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>OT7</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OT6</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>OT5</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>OT4</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>OT3</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OT2</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>OT1</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>OT0</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OSPEEDER</name><displayName>OSPEEDER</displayName><description>GPIO port output speed           register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OSPEEDR15</name><description>OSPEEDR15</description><bitOffset>30</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR14</name><description>OSPEEDR14</description><bitOffset>28</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR13</name><description>OSPEEDR13</description><bitOffset>26</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR12</name><description>OSPEEDR12</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR11</name><description>OSPEEDR11</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR10</name><description>OSPEEDR10</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR9</name><description>OSPEEDR9</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR8</name><description>OSPEEDR8</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR7</name><description>OSPEEDR7</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR6</name><description>OSPEEDR6</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR5</name><description>OSPEEDR5</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR4</name><description>OSPEEDR4</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR3</name><description>OSPEEDR3</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR2</name><description>OSPEEDR2</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR1</name><description>OSPEEDR1</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>OSPEEDR0</name><description>OSPEEDR0</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>PUPDR</name><displayName>PUPDR</displayName><description>GPIO port pull-up/pull-down           register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x64000000</resetValue><fields><field><name>PUPDR15</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>30</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR14</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>28</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR13</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>26</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR12</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR11</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR10</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR9</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR8</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR7</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR6</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR5</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR4</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR3</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR2</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR1</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR0</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>IDR</name><displayName>IDR</displayName><description>GPIO port input data register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>IDR15</name><description>Port input data (y =               0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR14</name><description>Port input data (y =               0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR13</name><description>Port input data (y =               0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR12</name><description>Port input data (y =               0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR11</name><description>Port input data (y =               0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR10</name><description>Port input data (y =               0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR9</name><description>Port input data (y =               0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR8</name><description>Port input data (y =               0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR7</name><description>Port input data (y =               0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR6</name><description>Port input data (y =               0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR5</name><description>Port input data (y =               0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR4</name><description>Port input data (y =               0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR3</name><description>Port input data (y =               0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR2</name><description>Port input data (y =               0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR1</name><description>Port input data (y =               0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR0</name><description>Port input data (y =               0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ODR</name><displayName>ODR</displayName><description>GPIO port output data register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>ODR15</name><description>Port output data (y =               0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR14</name><description>Port output data (y =               0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR13</name><description>Port output data (y =               0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR12</name><description>Port output data (y =               0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR11</name><description>Port output data (y =               0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR10</name><description>Port output data (y =               0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR9</name><description>Port output data (y =               0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR8</name><description>Port output data (y =               0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR7</name><description>Port output data (y =               0..15)</description><bitOffs