MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
   0..15)</description><bitOffset>26</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR12</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR11</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR10</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR9</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR8</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR7</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR6</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR5</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR4</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR3</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR2</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR1</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>PUPDR0</name><description>Port x configuration bits (y =               0..15)</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>IDR</name><displayName>IDR</displayName><description>GPIO port input data register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>IDR15</name><description>Port input data (y =               0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR14</name><description>Port input data (y =               0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR13</name><description>Port input data (y =               0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR12</name><description>Port input data (y =               0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR11</name><description>Port input data (y =               0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR10</name><description>Port input data (y =               0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR9</name><description>Port input data (y =               0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR8</name><description>Port input data (y =               0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR7</name><description>Port input data (y =               0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR6</name><description>Port input data (y =               0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR5</name><description>Port input data (y =               0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR4</name><description>Port input data (y =               0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR3</name><description>Port input data (y =               0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR2</name><description>Port input data (y =               0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR1</name><description>Port input data (y =               0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR0</name><description>Port input data (y =               0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ODR</name><displayName>ODR</displayName><description>GPIO port output data register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>ODR15</name><description>Port output data (y =               0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR14</name><description>Port output data (y =               0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR13</name><description>Port output data (y =               0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR12</name><description>Port output data (y =               0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR11</name><description>Port output data (y =               0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR10</name><description>Port output data (y =               0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR9</name><description>Port output data (y =               0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR8</name><description>Port output data (y =               0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR7</name><description>Port output data (y =               0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR6</name><description>Port output data (y =               0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR5</name><description>Port output data (y =               0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR4</name><description>Port output data (y =               0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR3</name><description>Port output data (y =               0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR2</name><description>Port output data (y =               0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR1</name><description>Port output data (y =               0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR0</name><description>Port output data (y =               0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BSRR</name><displayName>BSRR</displayName><description>GPIO port bit set/reset           register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>BR15</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>BR14</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>BR13</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>BR12</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>BR11</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>BR10</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>BR9</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>BR8</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>BR7</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>BR6</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>BR5</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>BR4</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>BR3</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>BR2</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>BR1</name><description>Port x reset bit y (y =               0..15)</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>BR0</name><description>Port x set bit y (y=               0..15)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>BS15</name><description>Port x set bit y (y=               0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>BS14</name><description>Port x set bit y (y=               0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>BS13</name><description>Port x set bit y (y=               0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>BS12</name><description>Port x set bit y (y=               0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>BS11</name><description>Port x set bit y (y=               0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BS10</name><description>Port x set bit y (y=               0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>BS9</name><description>Port x set bit y (y=               0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>BS8</name><description>Port x set bit y (y=               0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>BS7</name><description>Port x set bit y (y=               0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BS6</name><description>Port x set bit y (y=               0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BS5</name><description>Port x set bit y (y=               0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>BS4</name><description>Port x set bit y (y=               0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>BS3</name><description>Port x set bit y (y=               0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>BS2</name><description>Port x set bit y (y=               0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BS1</name><description>Port x set bit y (y=               0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>BS0</name><description>Port x set bit y (y=               0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>LCKR</name><displayName>LCKR</displayName><description>GPIO port configuration lock           register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>LCKK</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK15</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK14</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK13</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK12</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK11</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK10</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK9</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK8</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK7</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK6</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK5</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK4</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK3</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK2</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK1</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK0</name><description>Port x lock bit y (y=               0..15)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AFRL</name><displayName>AFRL</displayName><description>AFRL</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>AFRL7</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL6</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL5</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL4</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL3</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL2</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL1</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRL0</name><description>Alternate function selection for port x               bit y (y = 0..7)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>AFRH</name><displayName>AFRH</displayName><description>GPIO alternate function high           register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>AFRH15</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH14</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH13</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH12</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH11</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH10</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH9</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>AFRH8</name><description>Alternate function selection for port x               bit y (y = 8..15)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="GPIOC"><name>GPIOD</name><baseAddress>0x40020C00</baseAddress></peripheral><peripheral derivedFrom="GPIOC"><name>GPIOE</name><baseAddress>0x40021000</baseAddress></peripheral><peripheral derivedFrom="GPIOC"><name>GPIOH</name><baseAddress>0x40021400</baseAddress></peripheral><peripheral><name>I2C1</name><description>Inter-integrated circuit</description><groupName>I2C</groupName><baseAddress>0x40005400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>CR1</name><displayName>CR1</displayName><description>CR1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>SWRST</name><description>Software reset</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>ALERT</name><description>SMBus alert</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>PEC</name><description>Packet error checking</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>POS</name><description>Acknowledge/PEC Position (for data               reception)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>ACK</name><description>Acknowledge enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>STOP</name><description>Stop generation</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>START</name><description>Start generation</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>NOSTRETCH</name><description>Clock stretching disable (Slave               mode)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ENGC</name><description>General call enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>ENPEC</name><description>PEC enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ENARP</name><description>ARP enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SMBTYPE</name><description>SMBus type</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>SMBUS</name><description>SMBus mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PE</name><description>Peripheral enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>CR2</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>LAST</name><description>DMA last transfer</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAEN</name><description>DMA requests enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>ITBUFEN</name><description>Buffer interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>ITEVTEN</name><description>Event interrupt enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ITERREN</name><description>Error interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FREQ</name><description>Peripheral clock frequency</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field></fields></register><register><name>OAR1</name><displayName>OAR1</displayName><description>OAR1</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>ADDMODE</name><description>ADDMODE</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD_8_9</name><description>Interface address</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>ADD_1_7</name><description>Interface address</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth></field><field><name>ADD_0</name><description>Interface address</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OAR2</name><displayName>OAR2</displayName><description>OAR2</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>ADD2</name><description>Interface address</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth></field><field><name>ENDUAL</name><description>Dual addressing mode               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DR</name><displayName>DR</displayName><description>DR</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>DR</name><description>-bit data register</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>SR1</name><displayName>SR1</displayName><description>SR1</description><addressOffset>0x14</addressOffset><size>0x20</size><resetValue>0x0000</resetValue><fields><field><name>SMBALERT</name><description>SMBus alert</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIMEOUT</name><description>Timeout or Tlow error</desc