MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
ription><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PECERR</name><description>PEC Error in reception</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OVR</name><description>Overrun/Underrun</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AF</name><description>Acknowledge failure</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ARLO</name><description>Arbitration lost (master               mode)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BERR</name><description>Bus error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TxE</name><description>Data register empty               (transmitters)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RxNE</name><description>Data register not empty               (receivers)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>STOPF</name><description>Stop detection (slave               mode)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ADD10</name><description>10-bit header sent (Master               mode)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BTF</name><description>Byte transfer finished</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ADDR</name><description>Address sent (master mode)/matched               (slave mode)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SB</name><description>Start bit (Master mode)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>SR2</name><displayName>SR2</displayName><description>SR2</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x0000</resetValue><fields><field><name>PEC</name><description>acket error checking               register</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DUALF</name><description>Dual flag (Slave mode)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>SMBHOST</name><description>SMBus host header (Slave               mode)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>SMBDEFAULT</name><description>SMBus device default address (Slave               mode)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>GENCALL</name><description>General call address (Slave               mode)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TRA</name><description>Transmitter/receiver</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BUSY</name><description>Bus busy</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MSL</name><description>Master/slave</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCR</name><displayName>CCR</displayName><description>CCR</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>F_S</name><description>I2C master mode selection</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>DUTY</name><description>Fast mode duty cycle</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CCR</name><description>Clock control register in Fast/Standard               mode (Master mode)</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>TRISE</name><displayName>TRISE</displayName><description>TRISE</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0002</resetValue><fields><field><name>TRISE</name><description>Maximum rise time in Fast/Standard mode               (Master mode)</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="I2C1"><name>I2C2</name><baseAddress>0x40005800</baseAddress></peripheral><peripheral><name>IWDG</name><description>Independent watchdog</description><groupName>IWDG</groupName><baseAddress>0x40003000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>KR</name><displayName>KR</displayName><description>Key register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>KEY</name><description>Key value (write only, read               0000h)</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>PR</name><displayName>PR</displayName><description>Prescaler register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PR</name><description>Prescaler divider</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>RLR</name><displayName>RLR</displayName><description>Reload register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000FFF</resetValue><fields><field><name>RL</name><description>Watchdog counter reload               value</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>Status register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>RVU</name><description>Watchdog counter reload value               update</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PVU</name><description>Watchdog prescaler value               update</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>LCD</name><description>Liquid crystal display controller</description><groupName>LCD</groupName><baseAddress>0x40002400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>I2C1_EV</name><description>I2C1 event interrupt</description><value>31</value></interrupt><interrupt><name>I2C1_ER</name><description>I2C1 error interrupt</description><value>32</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MUX_SEG</name><description>Mux segment enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BIAS</name><description>Bias selector</description><bitOffset>5</bitOffset><bitWidth>2</bitWidth></field><field><name>DUTY</name><description>Duty selection</description><bitOffset>2</bitOffset><bitWidth>3</bitWidth></field><field><name>VSEL</name><description>Voltage source selection</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LCDEN</name><description>LCD controller enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FCR</name><displayName>FCR</displayName><description>frame control register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PS</name><description>PS 16-bit prescaler</description><bitOffset>22</bitOffset><bitWidth>4</bitWidth></field><field><name>DIV</name><description>DIV clock divider</description><bitOffset>18</bitOffset><bitWidth>4</bitWidth></field><field><name>BLINK</name><description>Blink mode selection</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>BLINKF</name><description>Blink frequency selection</description><bitOffset>13</bitOffset><bitWidth>3</bitWidth></field><field><name>CC</name><description>Contrast control</description><bitOffset>10</bitOffset><bitWidth>3</bitWidth></field><field><name>DEAD</name><description>Dead time duration</description><bitOffset>7</bitOffset><bitWidth>3</bitWidth></field><field><name>PON</name><description>Pulse ON duration</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>UDDIE</name><description>Update display done interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>SOFIE</name><description>Start of frame interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>HD</name><description>High drive enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>status register</description><addressOffset>0x8</addressOffset><size>0x20</size><resetValue>0x00000020</resetValue><fields><field><name>FCRSF</name><description>LCD Frame Control Register               Synchronization flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RDY</name><description>Ready flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>UDD</name><description>Update Display Done</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>UDR</name><description>Update display request</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SOF</name><description>Start of frame flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ENS</name><description>LCD enabled status</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>CLR</name><displayName>CLR</displayName><description>clear register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>UDDC</name><description>Update display done clear</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>SOFC</name><description>Start of frame flag clear</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RAM_COM0</name><displayName>RAM_COM0</displayName><description>display memory</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>S31</name><description>S31</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>S30</name><description>S30</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>S29</name><description>S29</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>S28</name><description>S28</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>S27</name><description>S27</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>S26</name><description>S26</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>S25</name><description>S25</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>S24</name><description>S24</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>S23</name><description>S23</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>S22</name><description>S22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>S21</name><description>S21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>S20</name><description>S20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>S19</name><description>S19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>S18</name><description>S18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>S17</name><description>S17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>S16</name><description>S16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>S15</name><description>S15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>S14</name><description>S14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>S13</name><description>S13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>S12</name><description>S12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>S11</name><description>S11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>S10</name><description>S10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>S09</name><description>S09</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>S08</name><description>S08</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>S07</name><description>S07</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>S06</name><description>S06</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>S05</name><description>S05</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>S04</name><description>S04</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>S03</name><description>S03</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>S02</name><description>S02</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>S01</name><description>S01</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>S00</name><description>S00</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RAM_COM1</name><displayName>RAM_COM1</displayName><description>display memory</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>S31</name><description>S31</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>S30</name><description>S30</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>S29</name><description>S29</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>S28</name><description>S28</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>S27</name><description>S27</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>S26</name><description>S26</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>S25</name><description>S25</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>S24</name><description>S24</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>S23</name><description>S23</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>S22</name><description>S22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>S21</name><description>S21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>S20</name><description>S20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>S19</name><description>S19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>S18</name><description>S18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>S17</name><description>S17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>S16</name><description>S16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>S15</name><description>S15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>S14</name><description>S14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>S13</name><description>S13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>S12</name><description>S12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>S11</name><description>S11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>S10</name><description>S10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>S09</name><description>S09</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>S08</name><description>S08</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>S07</name><description>S07</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>S06</name><description>S06</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>S05</name><description>S05</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>S04</name><description>S04</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>S03</name><description>S03</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>S02</name><description>S02</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>S01</name><description>S01</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>S00</name><description>S00</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RAM_COM2</name><displayName>RAM_COM2</displayName><description>display memory</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>S31</name><description>S31</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>S30</name><description>S30</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>S29</name><description>S29</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>S28</name><description>S28</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>S27</name><description>S27</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>S26</name><description>S26</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>S25</name><description>S25</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>S24</name><description>S24</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>S23</name><description>S23</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>S22</name><description>S22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>S21</name><description>S21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>S20</name><description>S20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>S19</name><description>S19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>S18</name><description>S18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>S17</name><description>S17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>S16</name><description>S16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>S15</name><description>S15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>S14</name><description>S14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>S13</name><description>S13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>S12</name><description>S12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>S11</name><description>S11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>S10</name><description>S10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>S09</name><description>S09</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>S08</name><description>S08</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>S07</name><description>S07</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>S06</name><description>S06</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>S05</name><description>S05</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>S04</name><description>S04</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>S03</name><description>S03</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>S02</name><description>S02</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>S01</name><description>S01</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>S00</name><description>S00</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RAM_COM3</name><displayName>RAM_COM3</displayName><description>display memory</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>S31</name><description>S31</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>S30</name><description>S30</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>S29</name><description>S29</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>S28</name><description>S28</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>S27</name><description>S27</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>S26</name><description>S26</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>S25</name><description>S25</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>S24</name><description>S24</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>S23</name><description>S23</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>S22</name><description>S22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>S21</name><description>S21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>S20</name><description>S20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>S19</name><description>S19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>S18</name><description>S18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>S17</name><description>S17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>S16</name><des