MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
cription>S16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>S15</name><description>S15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>S14</name><description>S14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>S13</name><description>S13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>S12</name><description>S12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>S11</name><description>S11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>S10</name><description>S10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>S09</name><description>S09</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>S08</name><description>S08</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>S07</name><description>S07</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>S06</name><description>S06</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>S05</name><description>S05</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>S04</name><description>S04</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>S03</name><description>S03</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>S02</name><description>S02</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>S01</name><description>S01</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>S00</name><description>S00</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RAM_COM4</name><displayName>RAM_COM4</displayName><description>display memory</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>S31</name><description>S31</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>S30</name><description>S30</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>S29</name><description>S29</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>S28</name><description>S28</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>S27</name><description>S27</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>S26</name><description>S26</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>S25</name><description>S25</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>S24</name><description>S24</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>S23</name><description>S23</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>S22</name><description>S22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>S21</name><description>S21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>S20</name><description>S20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>S19</name><description>S19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>S18</name><description>S18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>S17</name><description>S17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>S16</name><description>S16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>S15</name><description>S15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>S14</name><description>S14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>S13</name><description>S13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>S12</name><description>S12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>S11</name><description>S11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>S10</name><description>S10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>S09</name><description>S09</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>S08</name><description>S08</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>S07</name><description>S07</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>S06</name><description>S06</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>S05</name><description>S05</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>S04</name><description>S04</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>S03</name><description>S03</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>S02</name><description>S02</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>S01</name><description>S01</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>S00</name><description>S00</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RAM_COM5</name><displayName>RAM_COM5</displayName><description>display memory</description><addressOffset>0x3C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>S31</name><description>S31</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>S30</name><description>S30</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>S29</name><description>S29</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>S28</name><description>S28</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>S27</name><description>S27</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>S26</name><description>S26</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>S25</name><description>S25</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>S24</name><description>S24</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>S23</name><description>S23</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>S22</name><description>S22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>S21</name><description>S21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>S20</name><description>S20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>S19</name><description>S19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>S18</name><description>S18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>S17</name><description>S17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>S16</name><description>S16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>S15</name><description>S15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>S14</name><description>S14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>S13</name><description>S13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>S12</name><description>S12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>S11</name><description>S11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>S10</name><description>S10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>S09</name><description>S09</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>S08</name><description>S08</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>S07</name><description>S07</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>S06</name><description>S06</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>S05</name><description>S05</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>S04</name><description>S04</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>S03</name><description>S03</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>S02</name><description>S02</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>S01</name><description>S01</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>S00</name><description>S00</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RAM_COM6</name><displayName>RAM_COM6</displayName><description>display memory</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>S31</name><description>S31</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>S30</name><description>S30</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>S29</name><description>S29</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>S28</name><description>S28</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>S27</name><description>S27</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>S26</name><description>S26</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>S25</name><description>S25</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>S24</name><description>S24</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>S23</name><description>S23</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>S22</name><description>S22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>S21</name><description>S21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>S20</name><description>S20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>S19</name><description>S19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>S18</name><description>S18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>S17</name><description>S17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>S16</name><description>S16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>S15</name><description>S15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>S14</name><description>S14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>S13</name><description>S13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>S12</name><description>S12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>S11</name><description>S11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>S10</name><description>S10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>S09</name><description>S09</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>S08</name><description>S08</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>S07</name><description>S07</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>S06</name><description>S06</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>S05</name><description>S05</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>S04</name><description>S04</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>S03</name><description>S03</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>S02</name><description>S02</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>S01</name><description>S01</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>S00</name><description>S00</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RAM_COM7</name><displayName>RAM_COM7</displayName><description>display memory</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>S31</name><description>S31</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>S30</name><description>S30</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>S29</name><description>S29</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>S28</name><description>S28</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>S27</name><description>S27</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>S26</name><description>S26</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>S25</name><description>S25</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>S24</name><description>S24</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>S23</name><description>S23</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>S22</name><description>S22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>S21</name><description>S21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>S20</name><description>S20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>S19</name><description>S19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>S18</name><description>S18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>S17</name><description>S17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>S16</name><description>S16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>S15</name><description>S15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>S14</name><description>S14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>S13</name><description>S13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>S12</name><description>S12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>S11</name><description>S11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>S10</name><description>S10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>S09</name><description>S09</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>S08</name><description>S08</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>S07</name><description>S07</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>S06</name><description>S06</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>S05</name><description>S05</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>S04</name><description>S04</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>S03</name><description>S03</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>S02</name><description>S02</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>S01</name><description>S01</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>S00</name><description>S00</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>PWR</name><description>Power control</description><groupName>PWR</groupName><baseAddress>0x40007000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>I2C2_EV</name><description>I2C2 event interrupt</description><value>33</value></interrupt><interrupt><name>I2C2_ER</name><description>I2C2 error interrupt</description><value>34</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>power control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00001000</resetValue><fields><field><name>LPRUN</name><description>Low power run mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>VOS</name><description>Voltage scaling range               selection</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field><field><name>FWU</name><description>Fast wakeup</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>ULP</name><description>Ultralow power mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>DBP</name><description>Disable backup domain write               protection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>PLS</name><description>PVD level selection</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth></field><field><name>PVDE</name><description>Power voltage detector               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CSBF</name><description>Clear standby flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CWUF</name><description>Clear wakeup flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>PDDS</name><description>Power down deepsleep</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LPSDSR</name><description>Low-power deep sleep</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CSR</name><displayName>CSR</displayName><description>power control/status register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000008</resetValue><fields><field><name>EWUP3</name><description>Enable WKUP pin 3</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EWUP2</name><description>Enable WKUP pin 2</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EWUP1</name><description>Enable WKUP pin 1</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>REGLPF</name><description>Regulator LP flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>VOSF</name><description>Voltage Scaling select               flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>VREFINTRDYF</name><description>Internal voltage reference (VREFINT)               ready flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PVDO</name><description>PVD output</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SBF</name><description>Standby flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>WUF</name><description>Wakeup flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register></registers></peripheral><peripheral><name>RCC</name><description>Reset and clock control</description><groupName>RCC</groupName><baseAddress>0x40023800</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>CR</name><displayName>CR</displayName><description>Clock control register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000300</resetValue><fields><field><name>RTCPRE1</name><description>TC/LCD prescaler</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RTCPRE0</name><description>RTCPRE0</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CSSON</name><description>Clock security system               enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLRDY</name><description>PLL clock ready flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLON</name><description>PLL enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSEBYP</name><description>HSE clock bypass</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSERDY</name><description>HSE clock ready flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSEON</name><description>HSE clock enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MSIRDY</name><description>MSI clock ready flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>MSION</name><description>MSI clock enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSIRDY</name><description>Internal high-speed clock ready               flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSION</name><description>Internal high-speed clock               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ICSCR</name><displayName>ICSCR</displayName><description>Internal clock sources calibration           register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x0000B000</resetValue><fields><field><name>MSITRIM</name><description>MSI clock trimming</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field><field><name>MSICAL</name><description>MSI clock calibration</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>MSIRANGE</name><description>MSI clock ranges</description><bitOffset>13</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>HSITRIM</name><description>High speed internal clock               trimming</description><bitOffset>8</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>HSICAL</name><description>nternal high speed clock               calibration</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field></fields></register><register><name>CFGR</name><displayName>CFGR</displayName><description>Clock configuration register</description><addressOffset>0x8</addressOffset><size>0x20</size><reset