MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
Value>0x00000000</resetValue><fields><field><name>MCOPRE</name><description>Microcontroller clock output               prescaler</description><bitOffset>28</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>MCOSEL</name><description>Microcontroller clock output               selection</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PLLDIV</name><description>PLL output division</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PLLMUL</name><description>PLL multiplication factor</description><bitOffset>18</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>PLLSRC</name><description>PLL entry clock source</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PPRE2</name><description>APB high-speed prescaler               (APB2)</description><bitOffset>11</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PPRE1</name><description>APB low-speed prescaler               (APB1)</description><bitOffset>8</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>HPRE</name><description>AHB prescaler</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>SWS</name><description>System clock switch status</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>SW</name><description>System clock switch</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field></fields></register><register><name>CIR</name><displayName>CIR</displayName><description>Clock interrupt register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>CSSC</name><description>Clock security system interrupt               clear</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>LSECSSC</name><description>LSE CSS interrupt clear</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>MSIRDYC</name><description>MSI ready interrupt clear</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>PLLRDYC</name><description>PLL ready interrupt clear</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSERDYC</name><description>HSE ready interrupt clear</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSIRDYC</name><description>HSI ready interrupt clear</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>LSERDYC</name><description>LSE ready interrupt clear</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>LSIRDYC</name><description>LSI ready interrupt clear</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>LSECSSIE</name><description>LSE CSS interrupt enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MSIRDYIE</name><description>MSI ready interrupt enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLRDYIE</name><description>PLL ready interrupt enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSERDYIE</name><description>HSE ready interrupt enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSIRDYIE</name><description>HSI ready interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSERDYIE</name><description>LSE ready interrupt enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSIRDYIE</name><description>LSI ready interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CSSF</name><description>Clock security system interrupt               flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSECSSF</name><description>LSE CSS Interrupt flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>MSIRDYF</name><description>MSI ready interrupt flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLRDYF</name><description>PLL ready interrupt flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSERDYF</name><description>HSE ready interrupt flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSIRDYF</name><description>HSI ready interrupt flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSERDYF</name><description>LSE ready interrupt flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSIRDYF</name><description>LSI ready interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>AHBRSTR</name><displayName>AHBRSTR</displayName><description>AHB peripheral reset register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DMA2RST</name><description>DMA2 reset</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>DMA1RST</name><description>DMA1 reset</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FLITFRST</name><description>FLITF reset</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCRST</name><description>CRC reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOGRST</name><description>IO port G reset</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOFRST</name><description>IO port F reset</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOHRST</name><description>IO port H reset</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOERST</name><description>IO port E reset</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIODRST</name><description>IO port D reset</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOCRST</name><description>IO port C reset</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOBRST</name><description>IO port B reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOARST</name><description>IO port A reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB2RSTR</name><displayName>APB2RSTR</displayName><description>APB2 peripheral reset register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>USART1RST</name><description>USART1RST</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI1RST</name><description>SPI1RST</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC1RST</name><description>ADC1RST</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TM11RST</name><description>TM11RST</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TM10RST</name><description>TM10RST</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM9RST</name><description>TIM9RST</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SYSCFGRST</name><description>SYSCFGRST</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB1RSTR</name><displayName>APB1RSTR</displayName><description>APB1 peripheral reset register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>COMPRST</name><description>COMP interface reset</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>DACRST</name><description>DAC interface reset</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>PWRRST</name><description>Power interface reset</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>USBRST</name><description>USB reset</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2RST</name><description>I2C 2 reset</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1RST</name><description>I2C 1 reset</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>USART3RST</name><description>USART 3 reset</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2RST</name><description>USART 2 reset</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI3RST</name><description>SPI 3 reset</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2RST</name><description>SPI 2 reset</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>WWDRST</name><description>Window watchdog reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>LCDRST</name><description>LCD reset</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM7RST</name><description>Timer 7 reset</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM6RST</name><description>Timer 6reset</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM5RST</name><description>Timer 5 reset</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM4RST</name><description>Timer 4 reset</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3RST</name><description>Timer 3 reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM2RST</name><description>Timer 2 reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AHBENR</name><displayName>AHBENR</displayName><description>AHB peripheral clock enable           register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00008000</resetValue><fields><field><name>DMA2EN</name><description>DMA2 clock enable</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>DMA1EN</name><description>DMA1 clock enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FLITFEN</name><description>FLITF clock enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCEN</name><description>CRC clock enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOPGEN</name><description>IO port G clock enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOPFEN</name><description>IO port F clock enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOPHEN</name><description>IO port H clock enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOPEEN</name><description>IO port E clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOPDEN</name><description>IO port D clock enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOPCEN</name><description>IO port C clock enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOPBEN</name><description>IO port B clock enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOPAEN</name><description>IO port A clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB2ENR</name><displayName>APB2ENR</displayName><description>APB2 peripheral clock enable           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>USART1EN</name><description>USART1 clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI1EN</name><description>SPI 1 clock enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC1EN</name><description>ADC1 interface clock               enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM11EN</name><description>TIM11 timer clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM10EN</name><description>TIM10 timer clock enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM9EN</name><description>TIM9 timer clock enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SYSCFGEN</name><description>System configuration controller clock               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB1ENR</name><displayName>APB1ENR</displayName><description>APB1 peripheral clock enable           register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>COMPEN</name><description>COMP interface clock               enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>DACEN</name><description>DAC interface clock enable</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>PWREN</name><description>Power interface clock               enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>USBEN</name><description>USB clock enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2EN</name><description>I2C 2 clock enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1EN</name><description>I2C 1 clock enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>USART3EN</name><description>USART 3 clock enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2EN</name><description>USART 2 clock enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI3EN</name><description>SPI 3 clock enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2EN</name><description>SPI 2 clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>WWDGEN</name><description>Window watchdog clock               enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>LCDEN</name><description>LCD clock enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM7EN</name><description>Timer 7 clock enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM6EN</name><description>Timer 6 clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM5EN</name><description>Timer 5 clock enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM4EN</name><description>Timer 4 clock enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3EN</name><description>Timer 3 clock enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM2EN</name><description>Timer 2 clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AHBLPENR</name><displayName>AHBLPENR</displayName><description>AHB peripheral clock enable in low power           mode register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0101903F</resetValue><fields><field><name>DMA2LPEN</name><description>DMA2 clock enable during Sleep               mode</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>DMA1LPEN</name><description>DMA1 clock enable during Sleep               mode</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>SRAMLPEN</name><description>SRAM clock enable during Sleep               mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FLITFLPEN</name><description>FLITF clock enable during Sleep               mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCLPEN</name><description>CRC clock enable during Sleep               mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOGLPEN</name><description>IO port G clock enable during Sleep               mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOFLPEN</name><description>IO port F clock enable during Sleep               mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOHLPEN</name><description>IO port H clock enable during Sleep               mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOELPEN</name><description>IO port E clock enable during Sleep               mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIODLPEN</name><description>IO port D clock enable during Sleep               mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOCLPEN</name><description>IO port C clock enable during Sleep               mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOBLPEN</name><description>IO port B clock enable during Sleep               mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>GPIOALPEN</name><description>IO port A clock enable during Sleep               mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB2LPENR</name><displayName>APB2LPENR</displayName><description>APB2 peripheral clock enable in low power           mode register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>USART1LPEN</name><description>USART1 clock enable during Sleep               mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI1LPEN</name><description>SPI 1 clock enable during Sleep               mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC1LPEN</name><description>ADC1 interface clock enable during Sleep               mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM11LPEN</name><description>TIM11 timer clock enable during Sleep               mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM10LPEN</name><description>TIM10 timer clock enable during Sleep               mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM9LPEN</name><description>TIM9 timer clock enable during Sleep               mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SYSCFGLPEN</name><description>System configuration controller clock               enable during Sleep mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB1LPENR</name><displayName>APB1LPENR</displayName><description>APB1 peripheral clock enable in low power           mode register</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>COMPLPEN</name><description>COMP interface clock enable during Sleep               mode</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>DACLPEN</name><description>DAC interface clock enable during Sleep               mode</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>PWRLPEN</name><description>Power interface clock enable during               Sleep mode</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>USBLPEN</name><description>USB clock enable during Sleep               mode</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2LPEN</name><description>I2C 2 clock enable during Sleep               mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1LPEN</name><description>I2C 1 clock enable during Sleep               mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>USART3LPEN</name><description>USART 3 clock enable during Sleep               mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2LPEN</name><description>USART 2 clock enable during Sleep               mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2LPEN</name><description>SPI 2 clock enable during Sleep               mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>WWDGLPEN</name><description>Window watchdog clock enable during               Sleep mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>LCDLPEN</name><description>LCD clock enable during Sleep               mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM7LPEN</name><description>Timer 7 clock enable during Sleep               mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM6LPEN</name><description>Timer 6 clock enable during Sleep               mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM4LPEN</name><description>Timer 4 clock enable during Sleep               mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3LPEN</name><description>Timer 3 clock enable during Sleep               mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM2LPEN</name><description>Timer 2 clock enable during Sleep               mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CSR</name><displayName>CSR</displayName><description>Control/status register</description><addressOffset>0x34</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>LPWRSTF</name><description>Low-power reset flag</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WWDGRSTF</name><description>Window watchdog reset flag</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IWDGRSTF</name><description>Independent watchd