MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
og reset               flag</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SFTRSTF</name><description>Software reset flag</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PORRSTF</name><description>POR/PDR reset flag</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PINRSTF</name><description>PIN reset flag</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OBLRSTF</name><description>Options bytes loading reset               flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RMVF</name><description>Remove reset flag</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RTCRST</name><description>RTC software reset</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RTCEN</name><description>RTC clock enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RTCSEL</name><description>RTC and LCD clock source               selection</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>LSECSSD</name><description>CSS on LSE failure               Detection</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSECSSON</name><description>CSS on LSE enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSEBYP</name><description>External low-speed oscillator               bypass</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSERDY</name><description>External low-speed oscillator               ready</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSEON</name><description>External low-speed oscillator               enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSIRDY</name><description>Internal low-speed oscillator               ready</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSION</name><description>Internal low-speed oscillator               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>RI</name><description>Routing interface</description><groupName>RI</groupName><baseAddress>0x40007C04</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>LCD</name><description>LCD global interrupt</description><value>24</value></interrupt><registers><register><name>ICR</name><displayName>ICR</displayName><description>RI input capture register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IC4</name><description>IC4</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>IC3</name><description>IC3</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>IC2</name><description>IC2</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>IC1</name><description>IC1</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM</name><description>Timer select bits</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field><field><name>IC4IOS</name><description>Input capture 4 select               bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>IC3IOS</name><description>Input capture 3 select               bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>IC2IOS</name><description>Input capture 2 select               bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>IC1IOS</name><description>Input capture 1 select               bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>ASCR1</name><displayName>ASCR1</displayName><description>RI analog switches control register           1</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SCM</name><description>Switch control mode</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>CH30GR11_4</name><description>Analog switch control</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>CH29GR11_3</name><description>Analog switch control</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>CH28GR11_2</name><description>Analog switch control</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>CH27GR11_1</name><description>Analog switch control</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>VCOMP</name><description>ADC analog switch selection for internal               node to comparator 1</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>CH25</name><description>Analog I/O switch control of channel               CH25</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>CH24</name><description>Analog I/O switch control of channel               CH24</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>CH23</name><description>Analog I/O switch control of channel               CH23</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>CH22</name><description>Analog I/O switch control of channel               CH22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>CH21GR7_4</name><description>Analog switch control</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>CH20GR7_3</name><description>Analog switch control</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CH19GR7_2</name><description>Analog switch control</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>CH18GR7_1</name><description>Analog switch control</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>CH31GR7_1</name><description>Analog switch control</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>CH15GR9_2</name><description>Analog switch control</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>CH14GR9_1</name><description>Analog switch control</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CH13GR8_4</name><description>Analog switch control</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CH12GR8_3</name><description>Analog switch control</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CH11GR8_2</name><description>Analog switch control</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CH10GR8_1</name><description>Analog switch control</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CH9GR3_2</name><description>Analog switch control</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CH8GR3_1</name><description>Analog switch control</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CH7GR2_2</name><description>Analog switch control</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CH6GR2_1</name><description>Analog switch control</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>COMP1_SW1</name><description>Comparator 1 analog switch</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CH31GR11_5</name><description>Analog switch control</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CH3GR1_4</name><description>Analog switch control</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CH2GR1_3</name><description>Analog switch control</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CH1GR1_2</name><description>Analog switch control</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CH0GR1_1</name><description>Analog switch control</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ASCR2</name><displayName>ASCR2</displayName><description>RI analog switches control register           2</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>GR5_4</name><description>GR5_4 analog switch               control</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>GR6_4</name><description>GR6_4 analog switch               control</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>GR6_3</name><description>GR6_3 analog switch               control</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>GR7_7</name><description>GR7_7 analog switch               control</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>GR7_6</name><description>GR7_6 analog switch               control</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>GR7_5</name><description>GR7_5 analog switch               control</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>GR2_5</name><description>GR2_5 analog switch               control</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>GR2_4</name><description>GR2_4 analog switch               control</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>GR2_3</name><description>GR2_3 analog switch               control</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>GR9_4</name><description>GR9_4 analog switch               control</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>GR9_3</name><description>GR9_3 analog switch               control</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>GR3_5</name><description>GR3_5 analog switch               control</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>GR3_4</name><description>GR3_4 analog switch               control</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>GR3_3</name><description>GR3_3 analog switch               control</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>GR4_3</name><description>GR4_3 analog switch               control</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>GR4_2</name><description>GR4_2 analog switch               control</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>GR4_1</name><description>GR4_1 analog switch               control</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>GR5_3</name><description>GR5_3 analog switch               control</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>GR5_2</name><description>GR5_2 analog switch               control</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>GR5_1</name><description>GR5_1 analog switch               control</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>GR6_2</name><description>GR6_2 analog switch               control</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>GR6_1</name><description>GR6_1 analog switch               control</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>GR10_4</name><description>GR10_4 analog switch               control</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>GR10_3</name><description>GR10_3 analog switch               control</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>GR10_2</name><description>GR10_2 analog switch               control</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>GR10_1</name><description>GR10_1 analog switch               control</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>HYSCR1</name><displayName>HYSCR1</displayName><description>RI hysteresis control register           1</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PB</name><description>Port B hysteresis control               on/off</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>PA</name><description>Port A hysteresis control               on/off</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>HYSCR2</name><displayName>HYSCR2</displayName><description>RI hysteresis control register           2</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PD</name><description>Port D hysteresis control               on/off</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>PC</name><description>Port C hysteresis control               on/off</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>HYSCR3</name><displayName>HYSCR3</displayName><description>RI hysteresis control register           3</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PF</name><description>Port F hysteresis control               on/off</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>PE</name><description>Port E hysteresis control               on/off</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>HYSCR4</name><displayName>HYSCR4</displayName><description>Hysteresis control register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PG</name><description>Port G hysteresis control               on/off</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ASMR1</name><displayName>ASMR1</displayName><description>Analog switch mode register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Port A analog switch mode               selection</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CMR1</name><displayName>CMR1</displayName><description>Channel mask register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Port A channel masking</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CICR1</name><displayName>CICR1</displayName><description>Channel identification for capture           register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PA</name><description>Port A channel identification for               capture</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ASMR2</name><displayName>ASMR2</displayName><description>Analog switch mode register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PB</name><description>Port B analog switch mode               selection</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CMR2</name><displayName>CMR2</displayName><description>Channel mask register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PB</name><description>Port B channel masking</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CICR2</name><displayName>CICR2</displayName><description>Channel identification for capture           register</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PB</name><description>Port B channel identification for               capture</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ASMR3</name><displayName>ASMR3</displayName><description>Analog switch mode register</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PC</name><description>Port C analog switch mode               selection</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CMR3</name><displayName>CMR3</displayName><description>Channel mask register</description><addressOffset>0x38</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PC</name><description>Port C channel masking</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CICR3</name><displayName>CICR3</displayName><description>Channel identification for capture           register</description><addressOffset>0x3C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PC</name><description>Port C channel identification for               capture</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ASMR4</name><displayName>ASMR4</displayName><description>Analog switch mode register</description><addressOffset>0x40</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PF</name><description>Port F analog switch mode               selection</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CMR4</name><displayName>CMR4</displayName><description>Channel mask register</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PF</name><description>Port F channel masking</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CICR4</name><displayName>CICR4</displayName><description>Channel identification for capture           register</description><addressOffset>0x48</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PF</name><description>Port F channel identification for               capture</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ASMR5</name><displayName>ASMR5</displayName><description>Analog switch mode register</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PG</name><description>Port G analog switch mode               selection</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CMR5</name><displayName>CMR5</displayName><description>Channel mask register</description><addressOffset>0x50</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PG</name><description>Port G channel masking</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CICR5</name><displayName>CICR5</displayName><description>Channel identification for capture           register</description><addressOffset>0x54</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PG</name><description>Port G channel identification for               capture</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register></registers></peripheral><peripheral><name>RTC</name><description>Real-time clock</description><groupName>RTC</groupName><baseAddress>0x40002800</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>TR</name><displayName>TR</displayName><description>time register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PM</name><description>AM/PM notation</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>HT</name><description>Hour tens in BCD format</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field><field><name>HU</name><description>Hour units in BCD format</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>MNT</name><description>Minute tens in BCD format</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>MNU</name><description>Minute units in BCD format</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>ST</name><description>Second tens in BCD format</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>SU</name><description>Second units in BCD format</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>DR</name><displayName>DR</displayName><description>date register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00002101</resetValue><fields><field><name>YT</name><description>Year tens in BCD format</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field><field><name>YU</name><description>Year units in BCD format</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>WDU</name><description>Week day units</description><bitOffset>13</bitOffset><bitWidth>3</bitWidth></field><field><name>MT</name><description>Month tens in BCD format</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>MU</name><description>Month units in BCD format</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>DT</name><description>Date tens in BCD format</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>DU</name><description>Date units in BCD format</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CR</name><displayName>CR</displayName><description>control register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValu