MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP15R</name><displayName>BKP15R</displayName><description>backup register</description><addressOffset>0x8C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP16R</name><displayName>BKP16R</displayName><description>backup register</description><addressOffset>0x90</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP17R</name><displayName>BKP17R</displayName><description>backup register</description><addressOffset>0x94</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP18R</name><displayName>BKP18R</displayName><description>backup register</description><addressOffset>0x98</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP19R</name><displayName>BKP19R</displayName><description>backup register</description><addressOffset>0x9C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP20R</name><displayName>BKP20R</displayName><description>backup register</description><addressOffset>0xA0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP21R</name><displayName>BKP21R</displayName><description>backup register</description><addressOffset>0xA4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP22R</name><displayName>BKP22R</displayName><description>backup register</description><addressOffset>0xA8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP23R</name><displayName>BKP23R</displayName><description>backup register</description><addressOffset>0xAC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP24R</name><displayName>BKP24R</displayName><description>backup register</description><addressOffset>0xB0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP25R</name><displayName>BKP25R</displayName><description>backup register</description><addressOffset>0xB4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP26R</name><displayName>BKP26R</displayName><description>backup register</description><addressOffset>0xB8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP27R</name><displayName>BKP27R</displayName><description>backup register</description><addressOffset>0xBC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP28R</name><displayName>BKP28R</displayName><description>backup register</description><addressOffset>0xC0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP29R</name><displayName>BKP29R</displayName><description>backup register</description><addressOffset>0xC4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP30R</name><displayName>BKP30R</displayName><description>backup register</description><addressOffset>0xC8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP31R</name><displayName>BKP31R</displayName><description>backup register</description><addressOffset>0xCC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register></registers></peripheral><peripheral><name>SPI1</name><description>Serial peripheral interface</description><groupName>SPI</groupName><baseAddress>0x40013000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>PVD</name><description>PVD through EXTI Line detection
        interrupt</description><value>1</value></interrupt><registers><register><name>CR1</name><displayName>CR1</displayName><description>control register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>BIDIMODE</name><description>Bidirectional data mode               enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>BIDIOE</name><description>Output enable in bidirectional               mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCEN</name><description>Hardware CRC calculation               enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCNEXT</name><description>CRC transfer next</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>DFF</name><description>Data frame format</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>RXONLY</name><description>Receive only</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>SSM</name><description>Software slave management</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>SSI</name><description>Internal slave select</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>LSBFIRST</name><description>Frame format</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>SPE</name><description>SPI enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BR</name><description>Baud rate control</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>MSTR</name><description>Master selection</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CPOL</name><description>Clock polarity</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CPHA</name><description>Clock phase</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>control register 2</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>TXEIE</name><description>Tx buffer empty interrupt               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>RXNEIE</name><description>RX buffer not empty interrupt               enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRIE</name><description>Error interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FRF</name><description>Frame format</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SSOE</name><description>SS output enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TXDMAEN</name><description>Tx buffer DMA enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>RXDMAEN</name><description>Rx buffer DMA enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>status register</description><addressOffset>0x8</addressOffset><size>0x20</size><resetValue>0x0002</resetValue><fields><field><name>TIFRFE</name><description>TI frame format error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BSY</name><description>Busy flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>OVR</name><description>Overrun flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>MODF</name><description>Mode fault</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CRCERR</name><description>CRC error flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>UDR</name><description>Underrun flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CHSIDE</name><description>Channel side</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXE</name><description>Transmit buffer empty</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXNE</name><description>Receive buffer not empty</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>DR</name><displayName>DR</displayName><description>data register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>DR</name><description>Data register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CRCPR</name><displayName>CRCPR</displayName><description>CRC polynomial register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0007</resetValue><fields><field><name>CRCPOLY</name><description>CRC polynomial register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>RXCRCR</name><displayName>RXCRCR</displayName><description>RX CRC register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x0000</resetValue><fields><field><name>RxCRC</name><description>Rx CRC register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>TXCRCR</name><displayName>TXCRCR</displayName><description>TX CRC register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x0000</resetValue><fields><field><name>TxCRC</name><description>Tx CRC register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>I2SCFGR</name><displayName>I2SCFGR</displayName><description>I2S configuration register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>I2SMOD</name><description>I2S mode selection</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>I2SE</name><description>I2S Enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>I2SCFG</name><description>I2S configuration mode</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>PCMSYNC</name><description>PCM frame synchronization</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>I2SSTD</name><description>I2S standard selection</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>CKPOL</name><description>Steady state clock               polarity</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DATLEN</name><description>Data length to be               transferred</description><bitOffset>1</bitOffset><bitWidth>2</bitWidth></field><field><name>CHLEN</name><description>Channel length (number of bits per audio               channel)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>I2SPR</name><displayName>I2SPR</displayName><description>I2S prescaler register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000002</resetValue><fields><field><name>MCKOE</name><description>Master clock output enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ODD</name><description>Odd factor for the               prescaler</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>I2SDIV</name><description>I2S Linear prescaler</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="SPI1"><name>SPI2</name><baseAddress>0x40003800</baseAddress><interrupt><name>RCC</name><description>RCC global interrupt</description><value>5</value></interrupt></peripheral><peripheral><name>SYSCFG</name><description>System configuration controller</description><groupName>SYSCFG</groupName><baseAddress>0x40010000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>MEMRMP</name><displayName>MEMRMP</displayName><description>memory remap register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>MEM_MODE</name><description>MEM_MODE</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>BOOT_MODE</name><description>BOOT_MODE</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field></fields></register><register><name>PMC</name><displayName>PMC</displayName><description>peripheral mode configuration           register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>USB_PU</name><description>USB pull-up</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>EXTICR1</name><displayName>EXTICR1</displayName><description>external interrupt configuration register           1</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI3</name><description>EXTI x configuration (x = 0 to               3)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI2</name><description>EXTI x configuration (x = 0 to               3)</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI1</name><description>EXTI x configuration (x = 0 to               3)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI0</name><description>EXTI x configuration (x = 0 to               3)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>EXTICR2</name><displayName>EXTICR2</displayName><description>external interrupt configuration register           2</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI7</name><description>EXTI x configuration (x = 4 to               7)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI6</name><description>EXTI x configuration (x = 4 to               7)</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI5</name><description>EXTI x configuration (x = 4 to               7)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI4</name><description>EXTI x configuration (x = 4 to               7)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>EXTICR3</name><displayName>EXTICR3</displayName><description>external interrupt configuration register           3</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI11</name><description>EXTI x configuration (x = 8 to               11)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI10</name><description>EXTI10</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI9</name><description>EXTI x configuration (x = 8 to               11)</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI8</name><description>EXTI x configuration (x = 8 to               11)</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>EXTICR4</name><displayName>EXTICR4</displayName><description>external interrupt configuration register           4</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI15</name><description>EXTI x configuration (x = 12 to               15)</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI14</name><description>EXTI14</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI13</name><description>EXTI13</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI12</name><description>EXTI12</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register></registers></peripheral><peripheral><name>TIM10</name><description>General-purpose timers</description><groupName>TIM</groupName><baseAddress>0x40010C00</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>RTC_WKUP</name><description>RTC Wakeup through EXTI line
        interrupt</description><value>3</value></interrupt><interrupt><name>RTC_Alarm</name><description>RTC Alarms (A and B) through EXTI line
