MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
        interrupt</description><value>41</value></interrupt><registers><register><name>CR1</name><displayName>CR1</displayName><description>control register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CKD</name><description>Clock division</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>ARPE</name><description>Auto-reload preload enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>URS</name><description>Update request source</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>UDIS</name><description>Update disable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CEN</name><description>Counter enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DIER</name><displayName>DIER</displayName><description>Interrupt enable register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x0000</resetValue><fields><field><name>CC1IE</name><description>Capture/Compare 1 interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UIE</name><description>Update interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>status register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CC1OF</name><description>Capture/compare 1 overcapture               flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1IF</name><description>Capture/Compare 1 interrupt               flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UIF</name><description>Update interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>EGR</name><displayName>EGR</displayName><description>event generation register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CC1G</name><description>Capture/Compare 1               generation</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UG</name><description>Update generation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCMR1_Output</name><displayName>CCMR1_Output</displayName><description>capture/compare mode register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>OC1M</name><description>Output compare 1 mode</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>OC1PE</name><description>Output compare 1 preload               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OC1FE</name><description>Output compare 1 fast               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1S</name><description>Capture/Compare 1               selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>CCMR1_Input</name><displayName>CCMR1_Input</displayName><description>capture/compare mode register 1 (input           mode)</description><alternateRegister>CCMR1_Output</alternateRegister><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IC1F</name><description>Input capture 1 filter</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>ICPCS</name><description>Input capture 1 prescaler</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>CC1S</name><description>Capture/Compare 1               selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>CCER</name><displayName>CCER</displayName><description>capture/compare enable           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CC1NP</name><description>Capture/Compare 1 complementary output               Polarity</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1P</name><description>Capture/Compare 1 output               Polarity</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1E</name><description>Capture/Compare 1 output               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNT</name><displayName>CNT</displayName><description>counter</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>TIM10 counter</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>PSC</name><displayName>PSC</displayName><description>prescaler</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>PSC</name><description>TIM9 prescaler</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ARR</name><displayName>ARR</displayName><description>auto-reload register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>ARR</name><description>Auto-reload value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CCR1</name><displayName>CCR1</displayName><description>capture/compare register 1</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CCR1</name><description>Capture/Compare 1 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>OR</name><displayName>OR</displayName><description>option register</description><addressOffset>0x50</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>TI1_RMP</name><description>TIM11 Input 1 remapping               capability</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="TIM10"><name>TIM11</name><baseAddress>0x40011000</baseAddress><interrupt><name>SPI1</name><description>SPI1 global interrupt</description><value>35</value></interrupt></peripheral><peripheral><name>TIM2</name><description>General-purpose timers</description><groupName>TIM</groupName><baseAddress>0x40000000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>SPI2</name><description>SPI2 global interrupt</description><value>36</value></interrupt><registers><register><name>CR1</name><displayName>CR1</displayName><description>control register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CKD</name><description>Clock division</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>ARPE</name><description>Auto-reload preload enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CMS</name><description>Center-aligned mode               selection</description><bitOffset>5</bitOffset><bitWidth>2</bitWidth></field><field><name>DIR</name><description>Direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>OPM</name><description>One-pulse mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>URS</name><description>Update request source</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>UDIS</name><description>Update disable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CEN</name><description>Counter enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>control register 2</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>TI1S</name><description>TI1 selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>MMS</name><description>Master mode selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>CCDS</name><description>Capture/compare DMA               selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SMCR</name><displayName>SMCR</displayName><description>slave mode control register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>ETP</name><description>External trigger polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>ECE</name><description>External clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>ETPS</name><description>External trigger prescaler</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>ETF</name><description>External trigger filter</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>MSM</name><description>Master/Slave mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>TS</name><description>Trigger selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>OCCS</name><description>OCREF clear selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>SMS</name><description>Slave mode selection</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>DIER</name><displayName>DIER</displayName><description>Interrupt enable register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x0000</resetValue><fields><field><name>TDE</name><description>Trigger DMA request enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4DE</name><description>Capture/Compare 4 DMA request               enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3DE</name><description>Capture/Compare 3 DMA request               enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2DE</name><description>Capture/Compare 2 DMA request               enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1DE</name><description>Capture/Compare 1 DMA request               enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>UDE</name><description>Update DMA request enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TIE</name><description>Trigger interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4IE</name><description>Capture/Compare 4 interrupt               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3IE</name><description>Capture/Compare 3 interrupt               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2IE</name><description>Capture/Compare 2 interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1IE</name><description>Capture/Compare 1 interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UIE</name><description>Update interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>status register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CC4OF</name><description>Capture/compare 1 overcapture               flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3OF</name><description>Capture/compare 3 overcapture               flag</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2OF</name><description>Capture/compare 2 overcapture               flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1OF</name><description>Capture/compare 1 overcapture               flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TIF</name><description>Trigger interrupt flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4IF</name><description>Capture/Compare 4 interrupt               flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3IF</name><description>Capture/Compare 3 interrupt               flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2IF</name><description>Capture/Compare 2 interrupt               flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1IF</name><description>Capture/Compare 1 interrupt               flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UIF</name><description>Update interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>EGR</name><displayName>EGR</displayName><description>event generation register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>TG</name><description>Trigger generation</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4G</name><description>Capture/compare 4               generation</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3G</name><description>Capture/compare 3               generation</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2G</name><description>Capture/compare 2               generation</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1G</name><description>Capture/compare 1               generation</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UG</name><description>Update generation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCMR1_Output</name><displayName>CCMR1_Output</displayName><description>capture/compare mode register           1</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>OC2CE</name><description>Output compare 2 clear               enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>OC2M</name><description>Output compare 2 mode</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>OC2PE</name><description>Output compare 2 preload               enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>OC2FE</name><description>Output compare 2 fast               enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2S</name><description>Capture/Compare 2               selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>OC1CE</name><description>Output compare 1 clear               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OC1M</name><description>Output compare 1 mode</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>OC1PE</name><description>Output compare 1 preload               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OC1FE</name><description>Output compare 1 fast               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1S</name><description>Capture/Compare 1               selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>CCMR1_Input</name><displayName>CCMR1_Input</displayName><description>capture/compare mode register 1 (input           mode)</description><alternateRegister>CCMR1_Output</alternateRegister><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IC2F</name><description>Input capture 2 filter</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>IC2PCS</name><description>Input capture 2 prescaler</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>CC2S</name><description>Capture/Compare 2               selection</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>IC1F</name><description>Input capture 1 filter</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>ICPCS</name><description>Input capture 1 prescaler</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>CC1S</name><description>Capture/Compare 1               selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>CCMR2_Output</name><displayName>CCMR2_Output</displayName><description>capture/compare mode register           2</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>OC4CE</name><description>Output compare 4 clear               enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>OC4M</name><description>Output compare 4 mode</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>OC4PE</name><description>Output compare 4 preload               enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>OC4FE</name><description>Output compare 4 fast               enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4S</name><description>Capture/Compare 4               selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>OC3CE</name><description>Output compare 3 clear               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OC3M</name><description>Output compare 3 mode</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>OC3PE</name><description>Output compare 3 preload               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OC3FE</name><description>Output compare 3 fast               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3S</name><description>Capture/Compare 3               selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>CCMR2_Input</name><displayName>CCMR2_Input</displayName><description>capture/compare mode register 2 (input           mode)</description><alternateRegister>CCMR2_Output</alternateRegister><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IC4F</name><description>Input capture 4 filter</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>IC4PSC</name><description>Input capture 4 prescaler</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>CC4S</name><description>Capture/Compare 4               selection</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>IC3F</name><description>Input capture 3 filter</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>IC3PSC</name><description>Input capture 3 prescaler</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>CC3S</name><description>Capture/compare 3               selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>CCER</name><displayName>CCER</displayName><description>capture/compare enable           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CC4NP</name><description>Capture/Compare 4 output               Polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4P</name><description>Capture/Compare 4 output               Polarity</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4E</name><description>Capture/Compare 4 output               enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3NP</name><description>Capture/Compare 3 output               Polarity</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3P</name><description>Capture/Compare 3 output               Polarity</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3E</name><description>Capture/Compare 3 output               enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2NP</name><description>Capture/Compare 2 output               Polarity</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2P</name><description>Capture/Compare 2 output               Polarity</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2E</name><description>Capture/Compare 2 output               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1NP</name><description>Capture/Compare 1 complementary output               Polarity</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1P</name><description>Capture/Compare 1 output               Polarity</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1E</name><description>Capture/Compare 1 output               enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNT</name><displayName>CNT</displayName><description>counter</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CNT</name><description>TIM2 counter</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>PSC</name><displayName>PSC</displayName><description>prescaler</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>PSC</name><description>TIM2 prescaler</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ARR</name><displayName>ARR</displayName><description>auto-reload register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write<