MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
/access><resetValue>0x0000</resetValue><fields><field><name>ARR</name><description>Auto-reload value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CCR1</name><displayName>CCR1</displayName><description>capture/compare register 1</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CCR1</name><description>Capture/Compare 1 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CCR2</name><displayName>CCR2</displayName><description>capture/compare register 1</description><addressOffset>0x38</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CCR2</name><description>Capture/Compare 2 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CCR3</name><displayName>CCR3</displayName><description>capture/compare register 1</description><addressOffset>0x3C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CCR1</name><description>Capture/Compare 1 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CCR4</name><displayName>CCR4</displayName><description>capture/compare register 1</description><addressOffset>0x40</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CCR4</name><description>Capture/Compare 4 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DCR</name><displayName>DCR</displayName><description>DMA control register</description><addressOffset>0x48</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>DBL</name><description>DMA burst length</description><bitOffset>8</bitOffset><bitWidth>5</bitWidth></field><field><name>DBA</name><description>DMA base address</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>DMAR</name><displayName>DMAR</displayName><description>DMA address for full transfer</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>DMAB</name><description>DMA register for burst               accesses</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="TIM2"><name>TIM3</name><baseAddress>0x40000400</baseAddress><interrupt><name>SPI3</name><description>SPI3 global interrupt</description><value>46</value></interrupt></peripheral><peripheral derivedFrom="TIM2"><name>TIM4</name><baseAddress>0x40000800</baseAddress></peripheral><peripheral><name>TIM6</name><description>Basic timers</description><groupName>TIM</groupName><baseAddress>0x40001000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>TIM10</name><description>TIM10 global interrupt</description><value>26</value></interrupt><registers><register><name>CR1</name><displayName>CR1</displayName><description>TIM6 control register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>ARPE</name><description>Auto-reload preload enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OPM</name><description>One-pulse mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>URS</name><description>Update request source</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>UDIS</name><description>Update disable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CEN</name><description>Counter enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>TIM6 control register 2</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>MMS</name><description>Master mode selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>DIER</name><displayName>DIER</displayName><description>TIM6 DMA/Interrupt enable           register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>UDE</name><description>Update DMA request enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>UIE</name><description>Update interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>TIM6 status register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>UIF</name><description>Update interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>EGR</name><displayName>EGR</displayName><description>TIM6 event generation register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x0000</resetValue><fields><field><name>UG</name><description>Update generation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNT</name><displayName>CNT</displayName><description>TIM6 counter</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CNT</name><description>CNT</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>PSC</name><displayName>PSC</displayName><description>TIM6 prescaler</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>PSC</name><description>Prescaler valueThe counter clock               frequency CK_CNT is equal to fCK_PSC / (PSC[15:0] +               1).</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ARR</name><displayName>ARR</displayName><description>TIM6 auto-reload register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>ARR</name><description>Prescaler value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="TIM6"><name>TIM7</name><baseAddress>0x40001400</baseAddress><interrupt><name>TIM11</name><description>TIM11 global interrupt</description><value>27</value></interrupt></peripheral><peripheral><name>TIM9</name><description>General-purpose timers</description><groupName>TIM</groupName><baseAddress>0x40010800</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>TIM2</name><description>TIM2 global interrupt</description><value>28</value></interrupt><registers><register><name>CR1</name><displayName>CR1</displayName><description>control register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CKD</name><description>Clock division</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>ARPE</name><description>Auto-reload preload enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OMP</name><description>One-pulse mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>URS</name><description>Update request source</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>UDIS</name><description>Update disable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CEN</name><description>Counter enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>control register 2</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>MMS</name><description>Master mode selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>SMCR</name><displayName>SMCR</displayName><description>slave mode control register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>MSM</name><description>Master/Slave mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>TS</name><description>Trigger selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>SMS</name><description>Slave mode selection</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>DIER</name><displayName>DIER</displayName><description>Interrupt enable register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x0000</resetValue><fields><field><name>TIE</name><description>Trigger interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2IE</name><description>Capture/Compare 2 interrupt               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1IE</name><description>Capture/Compare 1 interrupt               enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UIE</name><description>Update interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>status register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CC2OF</name><description>Capture/compare 2 overcapture               flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1OF</name><description>Capture/compare 1 overcapture               flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TIF</name><description>Trigger interrupt flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2IF</name><description>Capture/Compare 2 interrupt               flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1IF</name><description>Capture/Compare 1 interrupt               flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UIF</name><description>Update interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>EGR</name><displayName>EGR</displayName><description>event generation register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>TG</name><description>Trigger generation</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2G</name><description>Capture/Compare 2               generation</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1G</name><description>Capture/Compare 1               generation</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>UG</name><description>Update generation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCMR1_Output</name><displayName>CCMR1_Output</displayName><description>capture/compare mode register           1</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>OC2CE</name><description>Output compare 2 clear               enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>OC2M</name><description>Output compare 2 mode</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>OC2PE</name><description>Output compare 2 preload               enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>OC2FE</name><description>Output compare 2 fast               enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2S</name><description>Capture/Compare 2               selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>OC1CE</name><description>Output compare 1 clear               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OC1M</name><description>Output compare 1 mode</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>OC1PE</name><description>Output compare 1 preload               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OC1FE</name><description>Output compare 1 fast               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1S</name><description>Capture/Compare 1               selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>CCMR1_Input</name><displayName>CCMR1_Input</displayName><description>capture/compare mode register 1 (input           mode)</description><alternateRegister>CCMR1_Output</alternateRegister><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>IC2F</name><description>Input capture 2 filter</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>IC2PCS</name><description>Input capture 2 prescaler</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>CC2S</name><description>Capture/Compare 2               selection</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>IC1F</name><description>Input capture 1 filter</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>ICPCS</name><description>Input capture 1 prescaler</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>CC1S</name><description>Capture/Compare 1               selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>CNT</name><displayName>CNT</displayName><description>counter</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>TIM9 counter</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>PSC</name><displayName>PSC</displayName><description>prescaler</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>PSC</name><description>TIM9 prescaler</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ARR</name><displayName>ARR</displayName><description>auto-reload register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>ARR</name><description>Auto-reload value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CCR1</name><displayName>CCR1</displayName><description>capture/compare register 1</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CCR1</name><description>Capture/Compare 1 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CCR2</name><displayName>CCR2</displayName><description>capture/compare register 2</description><addressOffset>0x38</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CCR2</name><description>Capture/Compare 2 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>OR</name><displayName>OR</displayName><description>option register</description><addressOffset>0x50</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>TI1_RMP</name><description>TIM9 Input 1 remapping               capability</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields></register></registers></peripheral><peripheral><name>USART1</name><description>Universal synchronous asynchronous receiver       transmitter</description><groupName>USART</groupName><baseAddress>0x40013800</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>TIM3</name><description>TIM3 global interrupt</description><value>29</value></interrupt><registers><register><name>SR</name><displayName>SR</displayName><description>Status register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00C00000</resetValue><fields><field><name>CTS</name><description>CTS flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LBD</name><description>LIN break detection flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXE</name><description>Transmit data register               empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TC</name><description>Transmission complete</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXNE</name><description>Read data register not               empty</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IDLE</name><description>IDLE line detected</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ORE</name><description>Overrun error</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NF</name><description>Noise detected flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FE</name><description>Framing error</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PE</name><description>Parity error</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>DR</name><displayName>DR</displayName><description>Data register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DR</name><description>Data value</description><bitOffset>0</bitOffset><bitWidth>9</bitWidth></field></fields></register><register><name>BRR</name><displayName>BRR</displayName><description>Baud rate register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DIV_Mantissa</name><description>mantissa of USARTDIV</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field><field><name>DIV_Fraction</name><description>fraction of USARTDIV</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CR1</name><displayName>CR1</displayName><description>Control register 1</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OVER8</name><description>Oversampling mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>UE</name><description>USART enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>M</name><description>Word length</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>WAKE</name><description>Wakeup method</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>PCE</name><description>Parity control enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>PS</name><description>Parity selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>PEIE</name><description>PE interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TXEIE</name><description>TXE interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transmission complete interrupt               enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>RXNEIE</name><description>RXNE interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>IDLEIE</name><description>IDLE interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TE</name><description>Transmitter enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>RE</name><description>Receiver enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RWU</name><description>Receiver wakeup</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SBK</name><description>Send break</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>Control register 2</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>LINEN</name><description>LIN mode enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>STOP</name><description>STOP bits</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>CLKEN</name><description>Clock enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CPOL</name><description>Clock polarity</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CPHA</name><description>Clock phase</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>LBCL</name><description>Last bit clock pulse</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>LBDIE</name><description>LIN break detection interrupt               enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LBDL</name><description>lin break detection length</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD</name><description>Address of the USART node</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CR3</name><displayName>CR3</displayName><description>Control register 3</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>ONEBIT</name><description>One sample bit method               enable</description><bi