MaJerle/stm32f429/00-STM32_SVD/STM32L15xxxA.svd
tOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CTSIE</name><description>CTS interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CTSE</name><description>CTS enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>RTSE</name><description>RTS enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAT</name><description>DMA enable transmitter</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAR</name><description>DMA enable receiver</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>SCEN</name><description>Smartcard mode enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NACK</name><description>Smartcard NACK enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>HDSEL</name><description>Half-duplex selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>IRLP</name><description>IrDA low-power</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>IREN</name><description>IrDA mode enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EIE</name><description>Error interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>GTPR</name><displayName>GTPR</displayName><description>Guard time and prescaler           register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>GT</name><description>Guard time value</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>PSC</name><description>Prescaler value</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="USART1"><name>USART2</name><baseAddress>0x40004400</baseAddress><interrupt><name>TIM4</name><description>TIM4 global interrupt</description><value>30</value></interrupt></peripheral><peripheral derivedFrom="USART1"><name>USART3</name><baseAddress>0x40004800</baseAddress><interrupt><name>TIM5</name><description>TIM5 global interrupt</description><value>45</value></interrupt></peripheral><peripheral><name>USB</name><description>Universal serial bus full-speed device       interface</description><groupName>USB</groupName><baseAddress>0x40005C00</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>TIM6</name><description>TIM6 global interrupt</description><value>43</value></interrupt><registers><register><name>USB_EP0R</name><displayName>USB_EP0R</displayName><description>endpoint 0 register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EA</name><description>Endpoint address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>USB_EP1R</name><displayName>USB_EP1R</displayName><description>endpoint 1 register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EA</name><description>Endpoint address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>USB_EP2R</name><displayName>USB_EP2R</displayName><description>endpoint 2 register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EA</name><description>Endpoint address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>USB_EP3R</name><displayName>USB_EP3R</displayName><description>endpoint 3 register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EA</name><description>Endpoint address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>USB_EP4R</name><displayName>USB_EP4R</displayName><description>endpoint 4 register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EA</name><description>Endpoint address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>USB_EP5R</name><displayName>USB_EP5R</displayName><description>endpoint 5 register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EA</name><description>Endpoint address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>USB_EP6R</name><displayName>USB_EP6R</displayName><description>endpoint 6 register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EA</name><description>Endpoint address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>USB_EP7R</name><displayName>USB_EP7R</displayName><description>endpoint 7 register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EA</name><description>Endpoint address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>USB_CNTR</name><displayName>USB_CNTR</displayName><description>control register</description><addressOffset>0x40</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000003</resetValue><fields><field><name>FRES</name><description>Force USB Reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PDWN</name><description>Power down</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LPMODE</name><description>Low-power mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FSUSP</name><description>Force suspend</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>RESUME</name><description>Resume request</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ESOFM</name><description>Expected start of frame interrupt               mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>SOFM</name><description>Start of frame interrupt               mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>RESETM</name><description>USB reset interrupt mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>SUSPM</name><description>Suspend mode interrupt               mask</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>WKUPM</name><description>Wakeup interrupt mask</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRM</name><description>Error interrupt mask</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>PMAOVRM</name><description>Packet memory area over / underrun               interrupt mask</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTRM</name><description>Correct transfer interrupt               mask</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ISTR</name><displayName>ISTR</displayName><description>interrupt status register</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EP_ID</name><description>Endpoint Identifier</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>DIR</name><description>Direction of transaction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ESOF</name><description>Expected start frame</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF</name><description>start of frame</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>RESET</name><description>reset request</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>SUSP</name><description>Suspend mode request</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>WKUP</name><description>Wakeup</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ERR</name><description>Error</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>PMAOVR</name><description>Packet memory area over /               underrun</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTR</name><description>Correct transfer</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FNR</name><displayName>FNR</displayName><description>frame number register</description><addressOffset>0x48</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x0000</resetValue><fields><field><name>FN</name><description>Frame number</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field><field><name>LSOF</name><description>Lost SOF</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field><field><name>LCK</name><description>Locked</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>RXDM</name><description>Receive data - line status</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>RXDP</name><description>Receive data + line status</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DADDR</name><displayName>DADDR</displayName><description>device address</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>ADD</name><description>Device address</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field><field><name>EF</name><description>Enable function</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BTABLE</name><displayName>BTABLE</displayName><description>Buffer table address</description><addressOffset>0x50</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>BTABLE</name><description>Buffer table</description><bitOffset>3</bitOffset><bitWidth>13</bitWidth></field></fields></register></registers></peripheral><peripheral derivedFrom="USB"><name>USB_SRAM</name><baseAddress>0x40006000</baseAddress><interrupt><name>TIM7</name><description>TIM7 global interrupt</description><value>44</value></interrupt></peripheral><peripheral><name>WWDG</name><description>Window watchdog</description><groupName>WWDG</groupName><baseAddress>0x40002C00</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>TIM9</name><description>TIM9 global interrupt</description><value>25</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>Control register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x0000007F</resetValue><fields><field><name>WDGA</name><description>Activation bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>T</name><description>7-bit counter (MSB to LSB)</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field></fields></register><register><name>CFR</name><displayName>CFR</displayName><description>Configuration register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x0000007F</resetValue><fields><field><name>EWI</name><description>Early wakeup interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>WDGTB1</name><description>Timer base</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WDGTB0</name><description>WDGTB0</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>W</name><description>7-bit window value</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>SR</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>EWIF</name><description>EWIF</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>ADC</name><description>Analog-to-digital converter</description><groupName>ADC</groupName><baseAddress>0x40012400</baseAddress